ลิขสิทธิ์ 2022-2023 Cocoa VPN Inc.
สงวนลิขสิทธิ์.

		Cocoa VPN เป็นเครื่องหมายการค้าจดทะเบียนของ Cocoa VPN Inc.

กิตติกรรมประกาศ

ขอบคุณ Christopher M. Kohlhoff สำหรับห้องสมุด Boost Asio ที่ยอดเยี่ยม
ได้รับอนุญาตภายใต้ Boost Software License

ขอบคุณ Paul Bakker และทีม mbedTLS ที่สร้างความกระชับ
และไลบรารี SSL ที่เรียบง่าย

ข้อจำกัดความรับผิดชอบ
 
ซอฟต์แวร์นี้มีให้ตามที่เป็นอยู่และการรับประกันโดยชัดแจ้งหรือโดยนัย
รวมถึงแต่ไม่จำกัดเพียงการรับประกันโดยปริยายของความสามารถในเชิงพาณิชย์
และความเหมาะสมสำหรับวัตถุประสงค์เฉพาะจะถูกปฏิเสธ ไม่ว่าในกรณีใด
		Cocoa VPN Inc. จะรับผิดชอบต่อการกระทำใดๆ ทั้งทางตรง ทางอ้อม โดยไม่ตั้งใจ
ความเสียหายพิเศษ ความเสียหายที่เป็นแบบอย่างหรือเป็นผลสืบเนื่อง รวมถึงแต่ไม่จำกัด
การจัดซื้อจัดจ้างสินค้าหรือบริการทดแทน การสูญเสียการใช้งาน ข้อมูล หรือ
กำไร; หรือการหยุดชะงักของธุรกิจ อย่างไรก็ตาม เกิดจากทฤษฎีใด
ความรับผิดไม่ว่าจะในสัญญา ความรับผิดโดยเคร่งครัด หรือการละเมิด (รวมถึง
ความประมาทเลินเล่อหรืออย่างอื่น) ที่เกิดขึ้นจากการใช้สิ่งนี้
ซอฟต์แวร์แม้ว่าจะได้รับคำแนะนำถึงความเป็นไปได้ของความเสียหายดังกล่าวก็ตาม

ข้อตกลงใบอนุญาตบุคคลที่สาม